{
  "basics": {
    "name": "Robbie Hickey",
    "label": "Software Engineer",
    "picture": "http://i.imgur.com/fpEoSu0.jpg",
    "email": "robbie.d.hickey@gmail.com",
    "phone": "(469)-270-0479",
    "website": "",
    "summary": "I’m a highly motivated and adaptable developer with an enthusiasm for new technologies and a passion for writing elegant software. My experience outlined below illustrates a persistent and rapid ability to learn on the job and acquire new skills. I believe that my skill set constitutes a unique candidate that could begin contributing immediately to delivering solutions for your customers.",
    "location": {
      "address": "7512 Brentwood Ct",
      "postalCode": "76182",
      "city": "North Richland Hills",
      "countryCode": "US",
      "region": "TX"
    },
    "profiles": [{
      "network": "LinkedIn",
      "username": "robbie.d.hickey",
      "url": "https://www.linkedin.com/pub/robbie-hickey/75/6a6/292"
    }]
  },
  "work": [{
    "company": "Training Moments, Inc",
    "position": "Software Consultant",
    "website": "http://www.eleadership360.com/",
    "startDate": "2015-07-01",
    "summary": "TMI provides clients with self and peer evaluation assessments for their employees; their end-user product is a report that outlines not only the results of the individual assessment, but also how their peers rated them. My responsibility was to provide a solution for a new Group Report product, which aggregated data across N number of individual assessments and summarized the data in an easy-to-consume format.",
    "highlights": [
      "Provided the client with a product that will create several new revenue streams leveraging the data they already have.",
      "Significantly simplified and refactored existing reporting logic, resulting in a 75% reduction in total LOC. All reports now derive from a common abstraction, giving future developers a roadmap for how to make enhancements"
    ]
  }, {
    "company": "Ruth Ruhl, P.C.",
    "position": "Software Consultant",
    "website": "http://www.rruhllaw.com/",
    "startDate": "2015-04-01",
    "summary": "Responsible for all ongoing maintenance and enhancements for multiple client-facing applications.",
    "highlights": [
      "Automated a number of manual business proceses, freeing up over 100 man hours/week.",
      "Implemented continuous integration leveraging TeamCity for all web applications."
    ]
  }, {
    "company": "Nexux Program Management Group",
    "position": "Software Consultant",
    "website": "http://www.nexuspmg.com",
    "startDate": "2015-02-01",
    "endDate": "2015-06-01",
    "summary": "Lead development on an MVP initiative for the company called CloudEPC (http://www.cloudepc.com/), which was designed to bring a modern progress tracking approach to large-scale construction projects.",
    "highlights": [
      "CloudEPC successfully completed several pilot projects which converted interested parties into full-time clients, providing new revenue streams as well as a full ROI.",
      "Responsible for the look-and-feel of the application. I also designed the client-side architecture which leveraged KendoUI and its SPA capabilities."
    ]
  }, {
    "company": "Thomson Reuters",
    "position": "Senior Software Engineer",
    "website": "http://www.thomsonreuters.com",
    "startDate": "2014-06-01",
    "endDate": "2015-03-01",
    "summary": "Thomson Reuters presented my first opportunity to work with an international organization. Through this experience I’ve improved upon many of my soft skills and learned to work and communicate effectively with culturally diverse and geographically dispersed teams.",
    "highlights": [
      "Elected as technical representative for UT career fair on multiple occasions due to my communication skills and passion for technology.",
      "Contributed pull requests to the front-end framework team, a pan Thomson Reuters initiative to formalize and standardize front end libraries, tooling and best practices.",
      "Added test coverage to all integration points where it was previously non-existent.",
      "Took over all legacy integration projects and updated to modern development standards, which included knowledge sharing and dissemination amongst the team. They are now well understood and documented, reducing risk for the organization and empowering all development teams to be cross-functional and agile."
    ]
  }, {
    "company": "Mortgage Specialst International",
    "position": "Leader Software Engineer",
    "website": "http://www.msionline.com/",
    "startDate": "2013-01-01",
    "endDate": "2014-06-01",
    "summary": "Upon being promoted to lead engineer, my role became more focused on mentoring and coordination. As the lead, it afforded me credibility to impact decision-making at a higher level, and allowed for greater emphasis on technology evangelism and training within the department.",
    "highlights": [
      "Designed and implemented an API service layer to prepare the company for integration opportunities and mobile applications.",
      "Designed and developed a Continuous Integration solution across all applications, replacing an entirely manual build and deployment process.",
      "Prepared ‘brown bag’ seminars to create an atmosphere of knowledge cultivation and growth.",
      "Became an evangelist for Agile development methodologies and spearheaded the movement away from Waterfall development. This change enabled the development team to respond more quickly to problems and has earned MSI a reputation in their industry for responsiveness and client satisfaction."
    ]
  }, {
    "company": "Mortgage Specialst International",
    "position": "Software Engineer",
    "website": "http://www.msionline.com/",
    "startDate": "2011-02-01",
    "endDate": "2013-01-01",
    "summary": "As an entry-level developer, my primary goal was to mitigate the learning curve and add a unique, youthful perspective to the development team. In a short time my resourcefulness transitioned me into a resource for more senior developers in the department.",
    "highlights": [
      "Became technical lead for a high-traffic, web-based BPO/Appraisal application which generates $15M in annual revenue. The site supports several integration points via WCF services, and leverages a service bus architecture that enables the business to frictionlessly board new clients and quickly incorporate third-party data providers.",
      "Enhanced UX on web applications by implementing and standardizing the use of client-side libraries such as Bootstrap/jQuery/KendoUI, as well as training the development staff on their use. This resulted in a much more consistent look and feel, and helped close the knowledge-gap that was forming due to aging skill-sets.",
      "Became a member of the Architecture Assessment team.",
      "Refactored the Javascript across all web applications to prevent pollution of the global namespace and to set a standard that encourages code reuse and modularity."
    ]
  }, {
    "company": "Mortgage Specialst International",
    "position": "Systems Engineer",
    "website": "http://www.msionline.com/",
    "startDate": "2010-02-01",
    "endDate": "2011-06-01",
    "summary": "It is difficult to pin a label on a job description during my time at MSI due to the number of concurrent responsibilities I was entrusted with. In my second year I began fulfilling a good deal of Systems duties as MSI does not employ a dedicated administrator. The promotion also afforded me the opportunity to return to school and finish my degree.",
    "highlights": [
      "Consolidated 30+ rack-mount servers to 3 hosts leveraging VMWare’s ESXi Hypervisor. This enabled the business to afford rackspace in a SAS 70 approved data center, and opened the door for lucrative contracts with the mortgage industry’s big players.",
      "Handled RFP and audit related matters for the department thanks to widespread knowledge of the systems and my role in maintaining them."
    ]
  }],
  "volunteer": [{
    "organization": "The Maker Spot",
    "position": "Volunteer",
    "website": "http://www.themakerspot.org/",
    "startDate": "2015-08-01",
    "summary": "",
    "highlights": []
  }],
  "education": [{
    "institution": "University of Texas at Arlington",
    "area": "Information Technology",
    "studyType": "Bachelor",
    "startDate": "2015-09-01",
    "endDate": "2012-06-01",
    "gpa": "3.5",
    "courses": []
  }],
  "awards": [],
  "publications": [],
  "skills": [{
    "name": "Front end",
    "keywords": [
      "HTML",
      "CSS",
      "Javascript",
      "TypeScript",
      "AngularJS",
      "React",
      "BackboneJS",
      "KendoUI",
      "KnockoutJS",
      "Bootstrap"
    ]
  }, {
    "name": "Back end",
    "keywords": [
      "ASP.NET Web Forms",
      "ASP.NET MVC",
      "ASP.NET Web API",
      "WCF",
      "Entity Framework",
      "NHibernate",
      "SQL Server",
      "MongoDB",
      "Silverlight",
      "Classic ASP",
      "NServiceBus",
      "MSMQ",
      "Windows Services",
      "NodeJS"
    ]
  }, {
    "name": "Administration",
    "keywords": [
      "IIS",
      "Windows Server",
      "Active Directory",
      "Exchange Server",
      "VMWare ESXi Hypervisor",
      "Debian flavors of Linux",
      "Active Directory"
    ]
  }, {
    "name": "Languages",
    "keywords": [
      "C#",
      "Javascript",
      "TypeScript",
      "PHP",
      "T-SQL",
      "Powershell",
      "Java",
      "Python",
      "bash",
      "Ruby"
    ]
  }, {
    "name": "Tools",
    "keywords": [
      "git",
      "mercurial",
      "tfs",
      "svn",
      "TeamCity",
      "CruiseControl.NET",
      "Jenkins",
      "npm",
      "grunt",
      "gulp",
      "bower",
      "browserify",
      "jasmine",
      "testem"
    ]
  }],
  "languages": [{
    "language": "English",
    "fluency": "Native speaker"
  }],
  "interests": [{
    "name": "Outdoors",
    "keywords": [
      "Hiking",
      "Camping",
      "Backpacking"
    ]
  }, {
    "name": "Gaming",
    "keywords": [
      "Board Games",
      "PC Games"
    ]
  }]
}
